# ZonePerimeter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZonePerimeter Property
ParameterTypeId Class See Also
---
"Perimeter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZonePerimeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZonePerimeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZonePerimeter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace